---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCFileModelOptions.Dispose
source: html/7dbc241b-50ae-d2be-f416-e4d99624e662.htm
---
# Autodesk.Revit.DB.IFC.IFCFileModelOptions.Dispose Method

Releases all resources used by the IFCFileModelOptions

## Syntax (C#)
```csharp
public void Dispose()
```